app/views/positions/show.haml

-current_user.positions.each do |position|
---
SELECT "positions".* FROM "positions" WHERE "positions"."user_id" = ?  [["user_id", 1]]