app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."discipline" = 'Business' LIMIT 1
SELECT "courses".* FROM "courses" ORDER BY courses.name ASC
---
  def index
  	if params.has_key?(:filter)
  		@courses = Course.find_all_by_discipline(params[:filter])
  		@current_course = Course.find_by_discipline(params[:filter]).discipline
  	else
  		@courses = Course.all.asc