app/controllers/funding_controller.rb

  def index

  	if params.has_key?(:filter)
	  	@funding = Funding.find_all_by_funding_type(params[:filter])
	  	@current_funding = Funding.find_by_funding_type(params[:filter]).funding_type
	else
  		@funding = Funding.all.asc
---
SELECT "fundings".* FROM "fundings" WHERE "fundings"."funding_type" = 'VC' LIMIT 1
SELECT "fundings".* FROM "fundings" ORDER BY fundings.name ASC