app/controllers/positions_controller.rb

SELECT "positions".* FROM "positions" WHERE "positions"."user_id" = ?  [["user_id", 1]]
---
  def show
      current_user.positions.each do |position|

INSERT INTO "positions" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 31 Mar 2014 04:04:40 UTC +00:00], ["title", "aaa"], ["updated_at", Mon, 31 Mar 2014 04:04:40 UTC +00:00]]
UPDATE "positions" SET "user_id" = ?, "updated_at" = ? WHERE "positions"."id" = 14  [["user_id", 1], ["updated_at", Mon, 31 Mar 2014 04:16:15 UTC +00:00]]
---
  def create
    @position = Position.create(position_params)
    @position.skill_list = (params['position']['skills'])
    @position.interest_list = (params['position']['interests'])
    @position.user_id = current_user.id

      if @position.save