app/controllers/student_groups_controller.rb

	def index

		@studentgroups = StudentGroups.all.asc
---
SELECT "student_groups".* FROM "student_groups" ORDER BY student_groups.name ASC